package abtractFactoryPattern;

public class Main {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
/*
 개요	
 	추상적인 공장(abstract factory)라는 의미는 언뜻 생각하면 너무 뜬급없는 단어의 조합입니다.
 	하지만, 조금 더 생각해보면추상적인 공장에서는 추상적인 제품을 만들 것 이라는 말이 될 것이고,
 	그 말은 다시말해 추상적인 공장은 추상적인 부품을 이용해 추상적인 제품을 만듭니다.
 	
 	이렇게 말로하면 당췌 무슨말인지 이해하기 힘들지만, 객체지향에 있어 추상(abstract)이란 단어를
 	생각할 필요가 있습니다. 객체지향의 추상을 생각하면서 다시 설명하면
 	'구현부에 신경쓰지 않고 인터페이스(API)만 생각' 하는 상태랄는 의미입니다.
 	예를 들어 추상 메소드는 실제로 로직이 구현되어 있지는 않고, 이름과 파라미터 타입만
 	정해져 있는 메소드입니다.
 	
 	정리하자면, 부품의 구현부에 신경쓰지 않고 인터페이스(API)에 집중하여, 인터페이스만을 사용해 
 	부품을 조립하고 제품으로 완성하는 방법입니다.
 	
 */